#### IPipePlumbingFixtureFlowServer Members

---

|  |
| --- |
| IPipePlumbingFixtureFlowServer Interface   Methods   See Also |

The  IPipePlumbingFixtureFlowServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Calculate | Calculate the pipe plumbing fixture flow. |
| Public method | GetDescription | Implement this method to return a description of the server. (Inherited from  IExternalServer  .) |
| Public method | GetHtmlDescription | The method that Revit will invoke to get an HTML formatted description of the server. |
| Public method | GetInformationLink | The method that Revit will invoke to obtain a URL address which provides more information about the server. |
| Public method | GetName | Implement this method to return the name of the server. (Inherited from  IExternalServer  .) |
| Public method | GetServerId | Implement this method to return the id of the server. (Inherited from  IExternalServer  .) |
| Public method | GetServiceId | Implement this method to return the id of the service. (Inherited from  IExternalServer  .) |
| Public method | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from  IExternalServer  .) |

# See Also

IPipePlumbingFixtureFlowServer Interface

Autodesk.Revit.DB.Plumbing Namespace